app/views/ads/homepage.html.erb

SELECT "categories".* FROM "categories"
---
          <ul>
            <% Category.all.each do |category| %>