app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "Roupas e acessórios"], ["created_at", "2018-06-28 00:19:32.477820"], ["updated_at", "2018-06-28 00:19:32.477820"]]